Table of Contents
 Class NonConformityIssue
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Non-conformity issue
public class NonConformityIssue
Inheritance
object
NonConformityIssue
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 NonConformityIssue()
Constructor
public NonConformityIssue()
Properties
 Description
Description of the nonconformity
public string Description { get; set; }
Property Value
string
 Guid
Description of the nonconformity
public Guid Guid { get; set; }
Property Value
Guid
 Severity
severity of this nonconformity
public NonConformitySeverity Severity { get; set; }
Property Value
NonConformitySeverity
 Edit this page